scripts/UC_2_buyItem/result1/Iteration6/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>Emma324</ns2:safePayUsername><ns2:safePayPassword>3955a048d7bcb7745a09572d096a254529f4409b</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886901234567890</ns2:cardNumber><ns2:expirationDate>072028</ns2:expirationDate><ns2:cvvNumber>953</ns2:cvvNumber><ns2:customerName>Emma Jones</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>